index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-12 Вт 23:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Логово</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="AmDer" />
<link rel="stylesheet" type="text/css" href="org.css" />
</head>
<body>
<div id="content">
<h1 class="title">Логово</h1>
<p>
Ресурс, посвящённый олимпиадам и внешкольным математике и программированию в <b>Мелеузе</b>. (обновления страницы каждое воскресенье)<br />
Заинтересованным писать в <a href="https://t.me/mlz_inc">Телегу</a> (чат mlz-inc) или на почту jury.mlz.inc@gmail.com <br />
</p>

<div id="outline-container-org9fcab3e" class="outline-2">
<h2 id="announce">Анонсы</h2>
<div class="outline-text-2" id="text-announce">
</div>

<div id="outline-container-orgf24cb3b" class="outline-3">
<h3 id="orgf24cb3b">Местный контест по программированию 16 или 17 мая</h3>
<div class="outline-text-3" id="text-orgf24cb3b">
<ul class="org-ul">
<li>Что будет: 5 задач на 2-3 часа.</li>
<li>Кто может принимать участие: все желающие</li>
<li>Платформа: codeforces.com</li>
<li>Is it rated? No.</li>
</ul>
<p>
Остальная информация позже. По вопросам писать в группу вк / в беседу Телеги. 
</p>
</div>
</div>
</div>

<div id="outline-container-orgfc21b41" class="outline-2">
<h2 id="aim">Цель создания логова</h2>
<div class="outline-text-2" id="text-aim">
<p>
Как известно, математического образования в Мелеузе <b>нет</b>. А значит, <b>нужно его создать</b>!<br />
<br />
Что до программирования, его основы даёт учитель 3-й гимназии. Однако его одного, очевидно, мало для всего города. Значит, <b>нужно помочь</b>!<br />
<br />
В наше время две эти области являются взаимодополняющими, поэтому продвигать их вместе является логичным.<br />
</p>
</div>

<div id="outline-container-org8948019" class="outline-3">
<h3 id="org8948019">Как это осуществить?</h3>
<div class="outline-text-3" id="text-org8948019">
<p>
   Олимпиадников в Мелеузе мало, все они сидят по своим домам, друг с другом не общаются из-за нехватки смелости / мыслей, что общение не так и важно / незнания о существовании других олимпиадников / иные причины. Можно попытаться изменить это, организовав ресурс, на котором будет "граф олимпиадной жизни" Мелеуза. Чтобы люди, заходившие сюда, находили нужные контакты и получали интересующую их информацию, причём не в школьном формате, когда вопросы задаются только учителям, а в через общение с такими же задротами (в хорошем смысле), как они. Впоследствии можно будет организовывать совместные покатушки на олимпиады / ботанье интересных тем / турниры по ЧГК.  <br />
<br />
Невероятно, но школьники сами способны обеспечить себе интересную учёбу при должной поддержке, сами могут организовать математический кружок, развивать свои задумки. Для этого достаточно смелости и желания познавать. 
</p>
</div>
</div>
</div>

<div id="outline-container-orgedc8e52" class="outline-2">
<h2 id="steps">Первые шаги</h2>
<div class="outline-text-2" id="text-steps">
<p>
  В ближайшие дни начну запрашивать разрешение известных мне олимпиадников для публикования их контактов, краткой информации о них на отдельной странце этого ресурса. Возможно сохранение анонимности, если кому-то нужно. Формат будет примерно таким (отдельно по предметам): <br />
&lt;Имя/ник человека&gt; &lt;опыт участия в олимпиадах&gt; &lt;темы, которые он хорошо знает&gt; &lt;темы, в которых интересуется&gt; &lt;контакты в телеге/где-то ещё&gt; <br />
<br />
Чем больше будет собрано информации, тем интереснее! Потом можно будет визуализировать это для большей наглядности. <br />
<br />
Также прошу всех из Мелеуза, кто участвует в контестах на codeforces, указывать страну и город. Так будет интереснее соревноваться между собой.
</p>
</div>
</div>
<div id="outline-container-orgdf2e9bb" class="outline-2">
<h2 id="orgdf2e9bb">Затравка</h2>
<div class="outline-text-2" id="text-orgdf2e9bb">
<p>
Никого не призываю осваивать эту жесть, но вот вам <a href="http://imperium.lenin.ru/~verbit/MATH/programma.html">программа Вербицкого</a>. Она, конечно, рассчитана на тех, кто хочет сделать математику свой профессией, однако может являться бездонным кладезем тем для изучения. <br />
<br />
Кроме того, уверен, будет интересно посмотреть курсы <a href="https://www.mccme.ru/ium/">НМУ</a>, а также записи прошлых лет <a href="https://www.mccme.ru/dubna/">школы "Современная математика"</a>.
</p>
</div>
</div>


<div id="outline-container-org6583ff0" class="outline-2">
<h2 id="links">ТИПО полезные ссылки:</h2>
<div class="outline-text-2" id="text-links">
<ul class="org-ul">
<li><a href="https://olimpiada.ru/">Olimpiada.ru</a> - сайт со школьными олимпиадами и новостями по ним, а также <a href="https://info.olimpiada.ru/events">список</a> ближайших олимпиад</li>
<li><a href="http://postypashki.ru/">Поступашки</a> - ресурс, на котором расписано, зачем нужны олимпиады, что такое БВИ и как проводится устный этап ТурГора</li>
<li><a href="http://postypashki.ru/%d0%bb%d0%b8%d1%82%d0%b5%d1%80%d0%b0%d1%82%d1%83%d1%80%d0%b0/">Список</a> полезной литературы и листков по математике с Поступашек</li>
<li>Платформа для соревнований по программированию <a href="https://codeforces.com/">codeforces.com</a></li>
<li>Новая платформа наподобие кодфорсеса - <a href="http://mathforces.com/">mathforces.com</a></li>

<li><a href="acmp/real_table.html">Таблица</a> <b>реального</b> рейтинга <a href="https://acmp.ru/">acmp.ru</a> по Мелеузу (показаны только активные за последние 30 дней, обновляется 3 раза в день)</li>
<li>Группы вк по олимппроге в Мелеузе <a href="https://vk.com/mlzinc">раз</a>, <a href="https://vk.com/olimpinf">два</a>.</li>
<li><a href="https://github.com/mlz-inc/mlz-inc.github.io">GitHub-репозиторий</a> этой страницы, в который каждый может вносить свои изменения (в случае полного доверия, напрямую)</li>
</ul>
</div>
</div>

<div id="outline-container-orgfcb33f1" class="outline-2">
<h2 id="questions">Начало</h2>
<div class="outline-text-2" id="text-questions">
<p>
Нужно определить, как сейчас обстоит дело с олимпиадами и в целом с уровнем матеши и проги в городе.<br />
</p>

<p>
Уже очень долгое время не поступает ответов. Чтож, придётся зарашить.
</p>
</div>

<div id="outline-container-org0fdc0a5" class="outline-4">
<h4 id="org0fdc0a5"><span class="todo TODO">TODO</span> Для того, чтобы преодолеть данный этап задаю вам (всем) вопросы:</h4>
<div class="outline-text-4" id="text-org0fdc0a5">
<ol class="org-ol">
<li>Кто из учителей заинтересован в олимпиадах по математике и программированию, и действительно <b>может подготовить</b> школьников до уровня хотя бы призёра региона?</li>
<li>В каких школах есть <b>"заражённые"</b> этими предметами ученики?</li>
<li>Как организовано <b>взаимодействие</b> между такими учениками?</li>
<li>Как организовывается <b>проведение олимпиад</b> (школьный, муниципальный этапы), осведомление школьников о <b>перечневых олимпиадах</b> и о том, как они помогают при поступлении в вузы?</li>
<li>Есть ли в городе люди, которым действительно <b>интересно заниматься</b> такой организацией, а не просто выполнять предписанные обязательства?</li>
<li>Есть ли среди выпускников школ Мелеуза люди, занимающиеся <b>реальной математикой</b>?</li>
</ol>
<p>
<br />
Ответы будут выкладываться сюда по мере их поступления. Прошу всяческого содействия. 
</p>

<p>
(Telegram: mlz-inc или jury.mlz.inc@gmail.com)
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: AmDer</p>
<p class="date">Created: 2020-05-12 Вт 23:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
